title: Windows CMD Invocation for Creating a New User for Persistence
id: 233d0629-5624-4a8f-9c78-8363dd58323f
status: experimental
description: Detects invocation of CMD commands, used by malware to create new a new user for persistence 
author: Maahir Shah
date: 2026-06-26
modified: 2026-06-26

logsource:
  product: windows
  service: sysmon

detection:
  selection:
    EventID: 1
    Image|endswith: '\cmd.exe'
    CommandLine|contains: 'net user'
    CommandLine|contains: '/add'
  condition: selection

level: high

tags:
  - attack.persistence
  - attack.execution
  - attack.t1136.001
  - attack.t1059.003